Диплом/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//--{ Khrom 30.03.2024 19:37:50  -- 
	ПолеВвода = Элементы.ВидДоговора;
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПолеВводаПриИзменении");
	
	ГруппаАбонентскоеОбслуживание = ДобавитьГруппуНаФорму("ГруппаАбонентскоеОбслуживание");
	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("ДатаНачалаДействияДоговора",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ДатаОкончанияДействияДоговора",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("СуммаАбонентскойПлаты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(17,2))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("СтоимостьЧасаРаботы",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(17,2))); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НовыйЭлемент = Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	НовыйЭлемент = Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонентскоеОбслуживание);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	//-- Khrom 30.03.2024 19:37:55  }--
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//--{ Khrom 30.03.2024 20:22:38  -- 
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		Если ТекущийОбъект.ВКМ_ДатаНачалаДействияДоговора = Дата(1,1,1) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните дату начала действия договора");
			Отказ = Истина;
		ИначеЕсли ТекущийОбъект.ВКМ_ДатаОкончанияДействияДоговора = Дата(1,1,1) Тогда
			ОбщегоНазначения.СообщитьПользователю("Заполните дату окончания действия договора");
			Отказ = Истина;
		ИначеЕсли ТекущийОбъект.ВКМ_СтоимостьЧасаРаботы = 0 Тогда	
			ОбщегоНазначения.СообщитьПользователю("Заполните стоимость часа работы");
			Отказ = Истина;
		ИначеЕсли ТекущийОбъект.ВКМ_СуммаАбонентскойПлаты = 0 Тогда	
			ОбщегоНазначения.СообщитьПользователю("Заполните сумму абонентской платы");	 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//-- Khrom 30.03.2024 20:22:48  }--
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//--{ Khrom 30.03.2024 20:38:57  -- 
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ДобавитьГруппуНаФорму("ГруппаАбонентскоеОбслуживание");
	КонецЕсли;
	//-- Khrom 30.03.2024 20:39:00  }--
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПолеВводаПриИзменении(Элемент)
	
	//--{ Khrom 30.03.2024 20:39:47  -- 
	Элементы.ГруппаАбонентскоеОбслуживание.Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	//-- Khrom 30.03.2024 20:39:56  }--
	
КонецПроцедуры

&НаСервере
Функция ДобавитьГруппуНаФорму(ИмяЭлемента)
	
	//--{ Khrom 30.03.2024 20:40:03  -- 
	ИскомаяГруппа = Элементы.Найти(ИмяЭлемента);
	Если ИскомаяГруппа <> Неопределено Тогда
		
		ИскомаяГруппа.Видимость = Истина;
		Возврат ИскомаяГруппа;
		
	КонецЕсли;
	
	ПолеВвода = Элементы.ВидДоговора;
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПолеВводаПриИзменении");
	
	ИскомаяГруппа = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"));
	ИскомаяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ИскомаяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ИскомаяГруппа.ОтображатьЗаголовок = ЛОЖЬ; 
	ИскомаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Элементы[ИмяЭлемента].Видимость = Ложь;
	
	Возврат ИскомаяГруппа;
	//-- Khrom 30.03.2024 20:40:08  }--
	
КонецФункции

 #КонецОбласти
